Revit 2027 API
SunAndShadowType Enumeration
 Sun study type enum of SunAndShadowSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SunAndShadowType
Public Enumeration SunAndShadowType
public enum class SunAndShadowType
type SunAndShadowType
Members
Member name | Value | Description
Lighting | 3 |  Lighting study type (fixed sun position regardless of date and time).
MultiDayStudy | 2 |  Multi day study type (range over date and time).
OneDayStudy | 1 |  Single day study type (time range over a specific day).
StillImage | 0 |  Still image study type (single point in time).
See Also
Reference
Autodesk.Revit.DB Namespace